---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainBelongsToMultipleBeltIntervals
source: html/7cab4452-00e0-3fc1-f406-15af853a059b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainBelongsToMultipleBeltIntervals Property

A chain formed by these curve elements defines a splitter belonging to multiple belt intervals and will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainBelongsToMultipleBeltIntervals { get; }
```